# 2.1 Skills

In this notebook we will:
- **review** Python data types and data structures
- **learn** how to work with the two main data types in `pandas`: `DataFrame` and `Series`

## Data types

### Numerical

Python has two numerical data types:
- `int`, e.g. `10`
- `float`, e.g. `10.12`

In [5]:
i = 10

In [6]:
type(i)

int

In [7]:
f = 10.12

In [8]:
isinstance(i, int)

True

In [9]:
isinstance(f, int)

False

In [10]:
type(f)

float

Python has two signs for division, which produce different results:

In [11]:
i // 3 == i / 3

False

In [12]:
i // 3

3

In [13]:
i / 3

3.3333333333333335

In [14]:
type(i // 3)

int

In [15]:
type(i / 3)

float

### Strings

In [16]:
mystring = "A string of text"

As of Python 3, strings are by default encoded in Unicode.

In [17]:
type(mystring.encode('utf-8'))

bytes

Strings in Python are **list** of characters, thus they can be manipulated as any other *iterable*.

In [18]:
# we can iterate through the characters
# of a string

for char in mystring:
    print(char)

A

s
t
r
i
n
g

o
f

t
e
x
t

In [19]:
# slicing by means of indices works as expected

mystring[2:]

'string of text'

In [20]:
mystring[-1]

't'

#### Concatenation

In [21]:
newstring = "This is " + mystring.lower()

In [22]:
newstring

'This is a string of text'

A very handy feature introduced in Python 3.6.x are f-strings:
- they are declared by prepending the character `f` to the quote signs containing the text
- they use curly brackets `{variable_name}` to specify the position in a string where the content of an existing variable should be inserted.

In [23]:
f'## {mystring} ##'

'## A string of text ##'

The curly brackets can contain *any* Python expression (except assignment of variables); the expression will be executed and its returned output interpolated within the string template.

In [24]:
f'The length of `mystring` is {len(mystring)} characters.'

'The length of `mystring` is 16 characters.'

**Q**: Can you explain what's going on in the cell below?

In [25]:
s = "repetita iuvant"
print(f'{", ".join([s for i in range(0, 10)])}')

repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant, repetita iuvant

Can you rewrite the cell above in an alternative way?

#### Transformation

In [26]:
mystring.lower()

'a string of text'

In [27]:
mystring.upper()

'A STRING OF TEXT'

In [28]:
mystring.replace("string", "list").replace("text", "characters")

'A list of characters'

### Date and time

 Limit of this data type when working with historical data (timestamps failed before a certain date around 1700).

#### `datetime.date`

In [35]:
from datetime import date, datetime

In [36]:
# `date` takes three arguments:
# 1. year, 2. month, 3. day

d = date(1982, 7, 17)

In [37]:
type(d)

datetime.date

**NB**: When creating a date, order matters! Try this:

In [38]:
d = date(19, 7, 1782)

ValueError: day is out of range for month

In [39]:
d.today()

datetime.date(2019, 7, 21)

In [40]:
f'{d.day}.{d.month}.{d.year}'

'17.7.1982'

In [41]:
f'{d.year}/{str(d.month)}/{d.day}'

'1982/7/17'

In [42]:
f'{d.year}/{str(d.month).zfill(2)}/{d.day}'

'1982/07/17'

#### `datetime.datetime`

`datetime` adds information about hour/minute/second/micro second to a date.

In [43]:
from datetime import datetime

In [44]:
dt = datetime.utcnow()

In [45]:
dt

datetime.datetime(2019, 7, 21, 18, 28, 52, 422532)

In [46]:
dt.isoformat()

'2019-07-21T18:28:52.422532'

In [47]:
dt.date()

datetime.date(2019, 7, 21)

In [48]:
datetime.now().strftime("%m/%d/%Y, %H:%M:%S")

'07/21/2019, 20:28:53'

## Python data structures

### Lists

In [49]:
l = list(range(0, 5))

In [50]:
l

[0, 1, 2, 3, 4]

The `extend()` method can be used to append elements to an existing list.

**NB**: `extend` operates directly on the list, modifying it in place.

In [51]:
l.extend(range(1, 10))

In [52]:
l

[0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [53]:
l + list(range(5, 10))

[0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 6, 7, 8, 9, 5, 6, 7, 8, 9]

In [54]:
l

[0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 6, 7, 8, 9]

`count()` can be used to count the number of times a given value is found within a list:

In [55]:
for n in range(0, 10):
    print(f'{n} occurs {l.count(n)} times in list `l`')

0 occurs 1 times in list `l`
1 occurs 2 times in list `l`
2 occurs 2 times in list `l`
3 occurs 2 times in list `l`
4 occurs 2 times in list `l`
5 occurs 1 times in list `l`
6 occurs 1 times in list `l`
7 occurs 1 times in list `l`
8 occurs 1 times in list `l`
9 occurs 1 times in list `l`

In [56]:
l

[0, 1, 2, 3, 4, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [57]:
l.index(4)

4

`pop()` remove the last item of a list and, as `extend()`, operates directly on the variable, modifying its value.

In [58]:
while(len(l) > 0):
    print(f'Removing {l.pop()} from my list')
    print(f'Size of `l` is {len(l)}')

Removing 9 from my list
Size of `l` is 13
Removing 8 from my list
Size of `l` is 12
Removing 7 from my list
Size of `l` is 11
Removing 6 from my list
Size of `l` is 10
Removing 5 from my list
Size of `l` is 9
Removing 4 from my list
Size of `l` is 8
Removing 3 from my list
Size of `l` is 7
Removing 2 from my list
Size of `l` is 6
Removing 1 from my list
Size of `l` is 5
Removing 4 from my list
Size of `l` is 4
Removing 3 from my list
Size of `l` is 3
Removing 2 from my list
Size of `l` is 2
Removing 1 from my list
Size of `l` is 1
Removing 0 from my list
Size of `l` is 0

In [59]:
# you cannot remove an element from an empty list

l.pop()

IndexError: pop from empty list

### Dictionaries

In [60]:
d = {
    "count": 0,
    "type": "child",
    "average": 1.2
}

In [61]:
d.keys()

dict_keys(['count', 'type', 'average'])

In [62]:
d.values()

dict_values([0, 'child', 1.2])

In [63]:
d['count']

0

In [64]:
d1 = {}

In [65]:
assert d1

AssertionError:

In [66]:
if d:
    print("hello")

hello

In [67]:
if d1:
    print("hello")

**Q**: Why? Can you explain what's going on?

### Tuples

Tuples are similar to lists, as they are both iterables.

In [68]:
t = tuple((0, "child", 1.2))

In [69]:
t

(0, 'child', 1.2)

As any interable, you can iterate over it (as one would expect):

In [70]:
for value in t:
    print(value)

0
child
1.2

The main difference between the two is that tuples do no support slicing.

In [71]:
t[1] = 'adult'

TypeError: 'tuple' object does not support item assignment

## Data structures (`pandas`)

### `Series`

In `pandas`, series are the building blocks of dataframes.

Think of a series as a column in a table. A series collects *observations* about a given *variable*.

In [72]:
from random import random
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

#### Numerical series

In [73]:
# let's create a series containing 100 random numbers
# ranging between 0 and 1

s = pd.Series([random() for n in range(0, 100)])

Each observation in the series has an **index** as well as a set of **values**: they can be accessed via the omonymous properties:

In [74]:
s.index

RangeIndex(start=0, stop=100, step=1)

In [75]:
list(s.index)

[0,
 1,
 2,
 3,
 4,
 5,
 6,
 7,
 8,
 9,
 10,
 11,
 12,
 13,
 14,
 15,
 16,
 17,
 18,
 19,
 20,
 21,
 22,
 23,
 24,
 25,
 26,
 27,
 28,
 29,
 30,
 31,
 32,
 33,
 34,
 35,
 36,
 37,
 38,
 39,
 40,
 41,
 42,
 43,
 44,
 45,
 46,
 47,
 48,
 49,
 50,
 51,
 52,
 53,
 54,
 55,
 56,
 57,
 58,
 59,
 60,
 61,
 62,
 63,
 64,
 65,
 66,
 67,
 68,
 69,
 70,
 71,
 72,
 73,
 74,
 75,
 76,
 77,
 78,
 79,
 80,
 81,
 82,
 83,
 84,
 85,
 86,
 87,
 88,
 89,
 90,
 91,
 92,
 93,
 94,
 95,
 96,
 97,
 98,
 99]

In [76]:
s.values

array([0.35138243, 0.74692349, 0.13671789, 0.51881088, 0.31311421,
       0.31183745, 0.06622851, 0.00546259, 0.77135186, 0.36736659,
       0.33438087, 0.85743278, 0.61506066, 0.28599041, 0.93086861,
       0.70745088, 0.6549735 , 0.86525793, 0.88101953, 0.27058276,
       0.70282372, 0.51336374, 0.4094033 , 0.88956458, 0.8807935 ,
       0.37302322, 0.90530088, 0.96428664, 0.1696535 , 0.10953016,
       0.26936358, 0.55121478, 0.99668812, 0.88965543, 0.61725043,
       0.11299245, 0.14880577, 0.52232895, 0.83943722, 0.72996142,
       0.31219257, 0.81335953, 0.74055709, 0.9789752 , 0.10893125,
       0.92207485, 0.40901162, 0.11722457, 0.39003368, 0.62235554,
       0.57303106, 0.39966922, 0.20265659, 0.2550844 , 0.86909237,
       0.95044787, 0.25193586, 0.20123974, 0.61471484, 0.92492439,
       0.21445917, 0.15574105, 0.35952066, 0.05929676, 0.60421629,
       0.73188196, 0.12775391, 0.8937069 , 0.59552651, 0.4461567 ,
       0.99384155, 0.89132943, 0.95257253, 0.05215578, 0.83917971,
       0.91743725, 0.63814826, 0.4048376 , 0.77850564, 0.26919558,
       0.39994652, 0.0392043 , 0.82098494, 0.32828485, 0.11180154,
       0.5811043 , 0.00874485, 0.40849631, 0.29562211, 0.92476861,
       0.69095561, 0.66295643, 0.19622221, 0.53116517, 0.55356111,
       0.33379549, 0.36461398, 0.08759961, 0.04904707, 0.26255933])

The `head()` and `tail()` methods allows for looking at the begininning and end of a series:

In [77]:
s.head()

0    0.351382
1    0.746923
2    0.136718
3    0.518811
4    0.313114
dtype: float64

In [78]:
s.tail()

95    0.333795
96    0.364614
97    0.087600
98    0.049047
99    0.262559
dtype: float64

The `value_counts()` method returns a count of distinct values within a series.

Is there any number in `s` that occurs twice?

In [79]:
# a `Series` can be easily cast into a list

list(s.value_counts()).count(2)

0

Another way of verifying this:

In [80]:
s.is_unique

True

In [81]:
s.min()

0.005462585301169942

In [82]:
s.max()

0.9966881209488291

In [83]:
s.mean()

0.5082206508979542

In [84]:
s.median()

0.516087307647585

#### Datetime series

In [85]:
from random import randint

In [86]:
# let's generate a list of random dates
# in the range 1900-1950

dates = [
    date(
        year,
        randint(1, 12),
        randint(1, 28) # try replacing with 31 and see what happens
    )
    for year in range(1900,1950)
]

In [87]:
s1 = pd.Series(dates)

In [88]:
s1

0     1900-08-19
1     1901-07-12
2     1902-03-02
3     1903-12-24
4     1904-11-14
5     1905-02-02
6     1906-05-28
7     1907-12-25
8     1908-11-08
9     1909-03-22
10    1910-03-08
11    1911-09-09
12    1912-07-06
13    1913-04-12
14    1914-03-06
15    1915-02-04
16    1916-11-21
17    1917-02-10
18    1918-08-05
19    1919-01-04
20    1920-07-04
21    1921-11-15
22    1922-11-08
23    1923-05-20
24    1924-06-14
25    1925-07-05
26    1926-12-25
27    1927-02-02
28    1928-06-03
29    1929-03-06
30    1930-04-24
31    1931-09-06
32    1932-07-22
33    1933-12-11
34    1934-02-07
35    1935-02-23
36    1936-02-16
37    1937-08-03
38    1938-11-10
39    1939-09-10
40    1940-09-18
41    1941-11-08
42    1942-07-14
43    1943-07-26
44    1944-06-07
45    1945-02-08
46    1946-12-28
47    1947-07-23
48    1948-08-22
49    1949-03-21
dtype: object

In [89]:
type(s1[1])

datetime.date

In [90]:
s1 = Series(pd.to_datetime(dates))

In [91]:
type(s1[1])

pandas._libs.tslibs.timestamps.Timestamp

In [92]:
s1[1].day_name()

'Friday'

In [93]:
s1.min()

Timestamp('1900-08-19 00:00:00')

In [94]:
s1.max()

Timestamp('1949-03-21 00:00:00')

In [95]:
s1.mean()

TypeError: DatetimeIndex cannot perform the operation mean

### `DataFrame`


What is a `pandas.DataFrame`? Think of it as an in-memory spreadsheet that you can analyse and manipulate programmatically.

A `DataFrame` is a collection of `Series` having the same length and whose indexes are in sync. A *collection* means that each column of a dataframe is a series

Let's create a toy `DataFrame` by hand.

In [96]:
dates = [
    date(
        year,
        randint(1, 12),
        randint(1, 28) # try replacing with 31 and see what happens
    )
    for year in range(1980,1990)
]

In [97]:
counts = [
    randint(0, 10000)
    for i in range(0, 10)
]

In [98]:
event_types = ["fire", "flood", "car_crash", "plane_crash"]
events = [
    np.random.choice(event_types)
    for i in range(0, 10)
]

In [99]:
assert len(events) == len(counts) == len(dates)

In [163]:
toy_df = pd.DataFrame({
    "date": dates,
    "count": counts,
    "event": events
})

In [164]:
toy_df

         date  count        event
0  1980-03-15    928  plane_crash
1  1981-11-23   8796        flood
2  1982-10-15   2449         fire
3  1983-06-03   7231         fire
4  1984-07-01   2715    car_crash
5  1985-07-15   7630         fire
6  1986-01-05   6321    car_crash
7  1987-11-25   6578        flood
8  1988-12-25   1925        flood
9  1989-09-16   5691  plane_crash

**Try out**: what happens if you change the length of either of the two lists? Try e.g. passing 20 dates instead of 10.

In [ ]:
# instead of a dictionary of lists, you can pass
# directly a dictionary of `pandas.Series`. The result is the same.

toy_df = pd.DataFrame(
    {
        "date": pd.to_datetime(date_series),
        "count": count_series,
        "event": Series(events)
    }
)

In [ ]:
toy_df

In [ ]:
# a df is a collection of series
# each column is a series

type(toy_df.date)

In [ ]:
toy_df.info()

## Data manipulation in `pandas`

### Data types

String, datetimes (see above), categorical data.

In `pandas`, categories behave very much like string, yet they lead to better performances (faster operations, optimized storage).

Bottom-up approach:

In [165]:
# transforms a Series with strings into categories

toy_df.event.astype('category')

0    plane_crash
1          flood
2           fire
3           fire
4      car_crash
5           fire
6      car_crash
7          flood
8          flood
9    plane_crash
Name: event, dtype: category
Categories (4, object): [car_crash, fire, flood, plane_crash]

Top-down approach:

In [166]:
# here the list of categories is defined beforehand

from pandas.api.types import CategoricalDtype

cat_type = CategoricalDtype(
    categories=["flood", "fire", "car_crash", "earth_quake", "plane_crash"],
    ordered=True
)

toy_df.event = toy_df.event.astype(cat_type)

In [167]:
toy_df.head(3)

         date  count        event
0  1980-03-15    928  plane_crash
1  1981-11-23   8796        flood
2  1982-10-15   2449         fire

**Question**: what happens if you remove e.g. "plane_crash" from the list `categories`? Can you explain why?

##### How are categories represented?

In [168]:
toy_df.event.cat.codes

0    4
1    0
2    1
3    1
4    2
5    1
6    2
7    0
8    0
9    4
dtype: int8

In [169]:
toy_df.event.cat.categories

Index(['flood', 'fire', 'car_crash', 'earth_quake', 'plane_crash'], dtype='object')

In [170]:
toy_df.event.cat.rename_categories({"plane_crash": "airplane_crash"}, inplace=True)

In [171]:
toy_df.head()

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood
2  1982-10-15   2449            fire
3  1983-06-03   7231            fire
4  1984-07-01   2715       car_crash

In [172]:
toy_df.event.cat.rename_categories({"plane_crash": "plane_crash"}, inplace=True)

In [173]:
toy_df.head()

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood
2  1982-10-15   2449            fire
3  1983-06-03   7231            fire
4  1984-07-01   2715       car_crash

In [174]:
# back to the original type

toy_df.event.astype(str)

0    airplane_crash
1             flood
2              fire
3              fire
4         car_crash
5              fire
6         car_crash
7             flood
8             flood
9    airplane_crash
Name: event, dtype: object

### Accessor properties

For certain data types (string, datetime), `pandas` provides a number of common methods that can be called on any series containing values of that type. These methods become available as methods of the series itself within a property — called *accessor* — named after the data type:

- the `.dt.*` accessor contains methods to operate on `datetime` series
- the `str.` accessor contains methods to operate on `str` (string) series.

As you will see in a moment, these methods are very convenient when filtering rows of a dataset based on the value of a certain column.

#### `datetime` accessor

To work with datetime series `pandas` provide a bunch of useful methods to operate on a series: they can be called from the `.dt` property of a datetime series.

They can be used to:
- convert from one timezone to another
- get the day/day name/month/year information from each date
- and much more (see the [documentation]())

In [175]:
s1.head()

0   1900-08-19
1   1901-07-12
2   1902-03-02
3   1903-12-24
4   1904-11-14
dtype: datetime64[ns]

In [176]:
s1.dt.weekday_name.head()

0      Sunday
1      Friday
2      Sunday
3    Thursday
4      Monday
dtype: object

#### `str` accessor

In [177]:
s = Series(["uno", "due", "tre"])

In [178]:
s.str.contains('o')

0     True
1    False
2    False
dtype: bool

### Exploring a dataframe

Exploring a dataframe: df.head(), df.tail(), df.info().

The method `info()` gives you information about a dataframe:
- how much space does it take in memory?
- what is the datatype of each column?
- how many records are there?
- how many `null` values does each column contain (!)?

In [179]:
toy_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
date     10 non-null object
count    10 non-null int64
event    10 non-null category
dtypes: category(1), int64(1), object(1)
memory usage: 450.0+ bytes

Alternatively, if you need to know only the number of columns and rows you can use the `.shape` property.

It returns a tuple with 1) number of rows, 2) number of columns.

In [180]:
toy_df.shape

(10, 3)

`head()` prints by first five rows of a dataframe:

In [181]:
toy_df.head()

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood
2  1982-10-15   2449            fire
3  1983-06-03   7231            fire
4  1984-07-01   2715       car_crash

But the number of lines displayed is a parameter that can be changed:

In [182]:
toy_df.head(2)

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood

`tail()` does the opposite, i.e. prints the last n rows in the dataframe:

In [183]:
toy_df.tail()

         date  count           event
5  1985-07-15   7630            fire
6  1986-01-05   6321       car_crash
7  1987-11-25   6578           flood
8  1988-12-25   1925           flood
9  1989-09-16   5691  airplane_crash

### Loading data

Dataframe can be created from scratch as we did above, but most often they are created by loading existing data into a dataframe by means of `pandas`' input/oputput methods.

#### From JSON

Loading data from a JSON file is very similar to creating a `DataFrame` from a `dict`.

This is how one would do it in pure Python:

In [184]:
import json
json_file_path = '../data/bl_books/sample/book_data_sample.json'

# JSON data gets read into a dictionary

with open(json_file_path, 'r') as jsonfile:
    json_data = json.load(jsonfile)
    
books_df = pd.DataFrame(json_data)

Since reading from files is a very common operation in any data analysis workflow, `pandas` provides methods to read from a variety of formats (JSON, CSV, clipboard, etc.)

The block of code above can be replaced by the following one-liner:

In [185]:
books_df = pd.read_json(json_file_path)

In [186]:
books_df = pd.DataFrame(json_data)

In [187]:
books_df.head(2)

,authors,corporate,date,datefield,edition,flickr_url_to_book_images,fulltext_filename,identifier,imgs,issuance,pdf,place,publisher,shelfmarks,title
0,{'creator': ['A. A.']},{},1841,1841,,http://www.flickr.com/photos/britishlibrary/ta...,sample/full_texts/000000196_01_text.json,000000196,NaN,monographic,{'1': 'lsidyv35c55757'},Calcutta,Privately printed,[British Library HMNTS 11601.ddd.2.],"[The Poetical Aviary, with a bird's-eye view o..."
1,"{'creator': ['Abbott, Evelyn']}",{},1888,1888,,http://www.flickr.com/photos/britishlibrary/ta...,sample/full_texts/000004047_01_text.json,000004047,{'0': {'000257': ['11104648374']}},monographic,{'1': 'lsidyv376da437'},London,Rivingtons,[British Library HMNTS 9025.cc.14.],[A History of Greece. Part I. From the earlies...

In [188]:
books_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 452 entries, 0 to 451
Data columns (total 15 columns):
authors                      452 non-null object
corporate                    452 non-null object
date                         452 non-null object
datefield                    452 non-null object
edition                      452 non-null object
flickr_url_to_book_images    452 non-null object
fulltext_filename            452 non-null object
identifier                   452 non-null object
imgs                         280 non-null object
issuance                     452 non-null object
pdf                          452 non-null object
place                        452 non-null object
publisher                    452 non-null object
shelfmarks                   452 non-null object
title                        452 non-null object
dtypes: object(15)
memory usage: 53.0+ KB

**NB**: note the number of missing values for the `books_df.imgs` (n=172).

#### From CSV

Similarly to `pandas.read_json()`, `pandas.read_csv()` is there to make your life easier when it comes to loading CSV data into a dataframe (and that happens very often!).

Let's import one of the CSV files from the "Venice Apprenticeship" dataset (`../data/apprenticeship_venice/`).

In [189]:
csv_file_path = '../data/apprenticeship_venice/professions_data.csv'

In [190]:
garzoni_df = pd.read_csv(csv_file_path)

ParserError: Error tokenizing data. C error: Expected 7 fields in line 36, saw 8

Why it did not work??

Let's have a look at the file first...

In [191]:
!head -n 2 ../data/apprenticeship_venice/professions_data.csv

page_title;register;annual_salary;a_profession;profession_code_strict;profession_code_gen;profession_cat;corporation;keep_profession_a;complete_profession_a;enrolmentY;enrolmentM;startY;startM;length;has_fled;m_profession;m_profession_code_strict;m_profession_code_gen;m_profession_cat;m_corporation;keep_profession_m;complete_profession_m;m_gender;m_name;m_surname;m_patronimic;m_atelier;m_coords;a_name;a_age;a_gender;a_geo_origins;a_geo_origins_std;a_coords;a_quondam;accommodation_master;personal_care_master;clothes_master;generic_expenses_master;salary_in_kind_master;pledge_goods_master;pledge_money_master;salary_master;female_guarantor;period_cat;incremental_salary
Carlo Della sosta (Orese) 1592-08-03;asv, giustizia vecchia, accordi dei garzoni, 114, 155;NA;orese;orese;orefice;orefice;Oresi;1;1;1592;08;1592;08;3;0;orese;orese;orefice;orefice;Oresi;1;1;1;Zuan Battista;Amigoni;;;0, 0;Carlo Della sosta;17;1;;;0, 0;1;0;1;1;1;0;0;0;0;0;NA;0

More than a comma-separated value, it looks like semicolon-separated values...

In [192]:
# the `sep` input parameter
# allows us to specify which character/symbol is used
# to separate column values

garzoni_df = pd.read_csv(
    csv_file_path,
    sep=';'
)

**NB**: There may be invalid lines in the data you are reading in. `read_csv()` puts you in full control of that: by setting the param `error_bad_lines=False` we tell `pandas` to ignore the "faulty" lines. 

This means that the entire file will be parsed, but invalid lines will be skipped.

In [193]:
garzoni_df = pd.read_csv(
    csv_file_path,
    sep=';',
    error_bad_lines=False,
    warn_bad_lines=False, # this turns off also the warnings
)

#### More format readers

See the [pandas documentation](https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html).

### Working with columns

#### Casting

We call *casting* the operation of changing the act of changing the data type of one or more variables.

In [194]:
# we define a string with value "10"
number_str = "10"

In [195]:
# we change its type from string (`str`)
# to integeer (`int`). This is call casting

number_int = int(number_str)

In [196]:
# the types of the two variable are different indeed

type(number_str) == type(number_int)

False

`pandas` objects like `Series` and `DataFrame` provide the method `astype()` to apply casting on their contents.

In [197]:
garzoni_df.head(3)

,page_title,register,annual_salary,a_profession,profession_code_strict,profession_code_gen,profession_cat,corporation,keep_profession_a,complete_profession_a,...,personal_care_master,clothes_master,generic_expenses_master,salary_in_kind_master,pledge_goods_master,pledge_money_master,salary_master,female_guarantor,period_cat,incremental_salary
0,Carlo Della sosta (Orese) 1592-08-03,"asv, giustizia vecchia, accordi dei garzoni, 1...",NaN,orese,orese,orefice,orefice,Oresi,1,1,...,1,1,1,0,0,0,0,0,NaN,0
1,Antonio quondam Andrea (squerariol) 1583-01-09,"asv, giustizia vecchia, accordi dei garzoni, 1...",12.5,squerariol,squerariol,lavori allo squero,lavori allo squero,Squerarioli,1,1,...,0,0,1,0,0,0,1,0,1.0,0
2,Cristofollo di Zuane (batioro in carta) 1591-0...,"asv, giustizia vecchia, accordi dei garzoni, 1...",NaN,batioro,batioro,battioro,fabbricatore di foglie/fili/cordelle d'oro o a...,Battioro,1,1,...,0,0,0,0,0,0,0,0,NaN,0

To cast the type of the `profession_cat` column, we can use directly the `astype()` method of the Series:

In [198]:
professions = garzoni_df.profession_cat.astype('category')

In [199]:
professions.cat.categories

Index([' . rilegatore di libri', 'acquaroli', 'acquavite',
       'acquavite . arrotino', 'acquavite . venditore di crusca', 'archibugi',
       'archibugi . ', 'arginatura canali', 'arrotino', 'ballerino',
       ...
       'venditori di profumi . pellicciaio', 'venditori di tele',
       'venditori di tele . cotone .  . fabbricatori di fustagni . merciaio . materassaio . rigattiere',
       'venditori di tele . fabbricatori di laccioli . merciaio',
       'venditori di tele . materassaio', 'venditori di tele . merciaio',
       'venditori di tele . merciaio . cotone .  . fabbricatori di fustagni',
       'venditori di tele . merciaio . fabbricatori di laccioli', 'vetraio',
       'vetraio . trasportatori di sabbia'],
      dtype='object', length=360)

Another way of doing this while operating on the dataframe is to use the dataframe's `astype()`:

In [200]:
from pandas.api.types import CategoricalDtype

In [201]:
profession_cat_type = CategoricalDtype(
    categories=garzoni_df.profession_cat[garzoni_df.profession_cat.notnull()].unique()
)

In [202]:
garzoni_df.dtypes.profession_cat

dtype('O')

In [203]:
garzoni_df = garzoni_df.astype(
    {
        "profession_cat": profession_cat_type
    }
)

In [204]:
garzoni_df.profession_cat

0                                                 orefice
1                                      lavori allo squero
2       fabbricatore di foglie/fili/cordelle d'oro o a...
3                                                merciaio
4                                                merciaio
5                                               falegname
6                   stampatori - diverse specializzazioni
7                                              specchiaio
8                                                 tintore
9                                    fabbricazione corone
10                                                 fabbro
11                      librai - diverse specializzazioni
12                                                 fabbro
13                                               merciaio
14                                             specchiaio
15                                             specchiaio
16                                             specchiaio
17                                             specchiaio
18                                             specchiaio
19      fabbricatore di foglie/fili/cordelle d'oro o a...
20                                                 colori
21                                              orpellaio
22                                                orefice
23                                                perlaio
24                      librai - diverse specializzazioni
25                                              tornitore
26                                               merciaio
27                                               merciaio
28                                             specchiaio
29      fabbricatore di foglie/fili/cordelle d'oro o a...
                              ...
9623                                  venditori di frutta
9624                      fabbricatore di valigie e bauli
9625                                  venditori di frutta
9626                                  barbiere . cerusico
9627                                                sarto
9628                                             linaiolo
9629                              fabbricazione calzature
9630                                             muratore
9631                                             speziale
9632                              fabbricatore di bilance
9633                            fabbricatore di passamani
9634                                               fabbro
9635              intagliatore - diverse specializzazioni
9636                              fabbricatore di pettini
9637                    librai - diverse specializzazioni
9638                               fabbricatore di chiodi
9639                                            falegname
9640                              fabbricazione calzature
9641                                             muratore
9642                                            tessitore
9643                                    venditore verdura
9644                              fabbricazione calzature
9645                                 fonditori di metalli
9646                                             merciaio
9647                            fabbricatore di passamani
9648                           paternosteri o margariteri
9649                              fabbricazione calzature
9650                       fabbricatore di casse e simili
9651                              fabbricazione calzature
9652                                              fornaio
Name: profession_cat, Length: 9653, dtype: category
Categories (360, object): [orefice, lavori allo squero, fabbricatore di foglie/fili/cordelle d'oro o a..., merciaio, ..., venditori di pece . linaiolo, cotone . materassaio . venditori di tele ., barbiere . cerusico . suonatore, bottonaio]

#### Adding columns

Let's go back to our toy dataframe:

In [205]:
toy_df.head()

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood
2  1982-10-15   2449            fire
3  1983-06-03   7231            fire
4  1984-07-01   2715       car_crash

Using the column selector with the name of a column that does not exist yet will add the effect of setting the values of all rows in that column to the value specified.

In [206]:
toy_df['country'] = "UK"

In [207]:
toy_df.head(3)

         date  count           event country
0  1980-03-15    928  airplane_crash      UK
1  1981-11-23   8796           flood      UK
2  1982-10-15   2449            fire      UK

But if the column already exists, its value is reset:

In [208]:
toy_df['country'] = "USA"

In [209]:
toy_df.head(3)

         date  count           event country
0  1980-03-15    928  airplane_crash     USA
1  1981-11-23   8796           flood     USA
2  1982-10-15   2449            fire     USA

#### Removing columns

The double square bracket notation ``[[...]]`` returns a dataframe having only the columns specified inside the inner brackets.

This said, removing a column is done by unselecting it:

In [210]:
# here we removed the column country 

toy_df2 = toy_df[['date', 'count', 'event']]

In [211]:
# it worked!

toy_df2.head()

         date  count           event
0  1980-03-15    928  airplane_crash
1  1981-11-23   8796           flood
2  1982-10-15   2449            fire
3  1983-06-03   7231            fire
4  1984-07-01   2715       car_crash

#### Setting a column as index

In [212]:
toy_df.set_index('date')

            count           event country
date
1980-03-15    928  airplane_crash     USA
1981-11-23   8796           flood     USA
1982-10-15   2449            fire     USA
1983-06-03   7231            fire     USA
1984-07-01   2715       car_crash     USA
1985-07-15   7630            fire     USA
1986-01-05   6321       car_crash     USA
1987-11-25   6578           flood     USA
1988-12-25   1925           flood     USA
1989-09-16   5691  airplane_crash     USA

In [213]:
toy_df.head(3)

         date  count           event country
0  1980-03-15    928  airplane_crash     USA
1  1981-11-23   8796           flood     USA
2  1982-10-15   2449            fire     USA

In [214]:
toy_df.set_index('date', inplace=True)

In [215]:
toy_df.head(3)

            count           event country
date
1980-03-15    928  airplane_crash     USA
1981-11-23   8796           flood     USA
1982-10-15   2449            fire     USA

**Q**: can you explain the effect of the `inplace` parameter by looking at the cells above?

### Accessing data

 .loc, .iloc, slicing, iteration over rows

In [216]:
toy_df.head(3)

            count           event country
date
1980-03-15    928  airplane_crash     USA
1981-11-23   8796           flood     USA
1982-10-15   2449            fire     USA

#### Label-based indexing

In [ ]:
toy_df.loc['1902':'1904']

#### Integer-based indexing

In [218]:
# select a single row, the first one

toy_df.iloc[0]

count                 928
event      airplane_crash
country               USA
Name: 1980-03-15, dtype: object

In [219]:
# select  a range of rows by index

toy_df.iloc[[1,3,-1]]

            count           event country
date
1981-11-23   8796           flood     USA
1983-06-03   7231            fire     USA
1989-09-16   5691  airplane_crash     USA

In [220]:
# select  a range of rows with slicing

toy_df.iloc[0:5]

            count           event country
date
1980-03-15    928  airplane_crash     USA
1981-11-23   8796           flood     USA
1982-10-15   2449            fire     USA
1983-06-03   7231            fire     USA
1984-07-01   2715       car_crash     USA

In [222]:
toy_df.index

Index([1980-03-15, 1981-11-23, 1982-10-15, 1983-06-03, 1984-07-01, 1985-07-15,
       1986-01-05, 1987-11-25, 1988-12-25, 1989-09-16],
      dtype='object', name='date')

#### Iterating over rows

In [225]:
for n, row in toy_df.iterrows():
    print(n)

1980-03-15
1981-11-23
1982-10-15
1983-06-03
1984-07-01
1985-07-15
1986-01-05
1987-11-25
1988-12-25
1989-09-16

In [226]:
for n, row in toy_df.iterrows():
    print(n, row.event)

1980-03-15 airplane_crash
1981-11-23 flood
1982-10-15 fire
1983-06-03 fire
1984-07-01 car_crash
1985-07-15 fire
1986-01-05 car_crash
1987-11-25 flood
1988-12-25 flood
1989-09-16 airplane_crash